# ありえるのは一桁目が 1 3 7 9のどれか
# 実際に7を太らせていくことは桁数的に不可能, なので素因数分解したものでKを構築するのも無理

# 777 -> 3*7*37
# 7777 -> 7*11*101
# 77777 -> 7*41*271
# 777777 -> 3*7*7*11*13*37
# 7777777 -> 7+239*4649
# 77777777 -> 7*11*73*101*137

# たとえば13の倍数がそれになるとき末尾が7になる条件は、3 6 9 2 5 8 1 4 7 で9番目、次は19、次は29
# 末尾から2つ目は最初が6番目、次が21番目、次が29番目、次が44、次が52
# 3つ目は54~61
k = int(input())
if k % 10 not in [1, 3, 7, 9]:
    print(-1)
    exit()
i = 1
now = 7

js = 13
for i in range(1, 70):
    print(f"i, js = {i}, {js}")
    js += 13

while True:
    if i > 18:
        break
    print(f"now = {now}")
    if now % k == 0:
        print(f"ok i = {i}")
        exit()
    i += 1
    now = now * 10 + 7
