# 上一列だけ見るのでよくない？なんなら直前のやつだけでもいいんじゃない？
# あ 敷き詰め方は与えられるのか。それも含めて総数を出すのかと思ってた
# 雑に試したらいけたっぽい ifを重ねるたびに不安になる
# 直前が縦に同じ色で今が縦に同じ色 -> 2種類使える
# 直前が縦に同じ色で今が横に同じ色 -> （直前に使った色以外の2種類を縦に重ねる組み合わせで）2種類使える
# 直前が横に同じ色で今が縦に同じ色 -> （直前に2色使っているので）1色だけ使える
# 直前が横に同じ色で今が横に同じ色 -> （直下参照）3パターンある

# --- 縦に2種類使った後に縦に2種類使う組み合わせ ---
# 1 - 2,2,3
# 2 - 1,3,1
# よって3パターン

n = int(input())
s1, s2 = input(), input()
ans = 0
idx = 0
MOD = 10**9 + 7
pre = -1  # i-1の色の数 1or2
while idx < n:
    if s1[idx] == s2[idx]:
        if idx == 0:
            ans = 3
        else:
            if pre == 1:
                ans *= 2
            elif pre == 2:
                ans *= 1  # 直前で使ってない色だけ使える
        pre = 1
        idx += 1
    else:
        if idx == 0:
            ans = 6
        else:
            if pre == 1:
                ans *= 2
            elif pre == 2:
                ans *= 3
        pre = 2
        idx += 2
    ans %= MOD

print(ans)